print('Введите данные квадратного уравнения вида ax**2 + bx + c = 0:')
a = int(input('a:'))
b = int(input('b:'))
c = int(input('c:'))
p=0
for k in range(-10000,100000):
    if k == (b**2 - 4*a*c)**(0.5):
        p += 111
        D = int((b**2 - 4*a*c)**(0.5))
        if D<0:
            print('Дискриминант ниже нуля, решений нет')
        if D==0:
            print('x1,2=',(-b)/(2*a))
        if D>0:
            print('x1=', ((-b)-D)/(2*a), 'x2=', ((-b)+D)/(2*a))
if p == 0:
    print('корень из дискриминанта не извлекается')
    
